---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadBase.LoadCaseId
source: html/8bb0908c-30a7-f090-7586-b1bab8e8cc42.htm
---
# Autodesk.Revit.DB.Structure.LoadBase.LoadCaseId Property

The load case ID for the load.

## Syntax (C#)
```csharp
public ElementId LoadCaseId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null